app/Http/Requests/StoreClientProgramRequest.php

    public function __construct(ClientRepositoryInterface $clientRepository, ProgramRepositoryInterface $programRepository, ClientProgramRepositoryInterface $clientProgramRepository)
    {
        $this->admission_prog_id = Program::whereHas('main_prog', function($query) {
                                        $query->where('prog_name', 'Admissions Mentoring');
                                    })->orWhereHas('sub_prog', function ($query) {
                                        $query->where('sub_prog_name', 'Admissions Mentoring');
                                    })->pluck('prog_id')->toArray();

        $this->tutoring_prog_id = Program::whereHas('main_prog', function($query) {
                                        $query->where('prog_name', 'Academic & Test Preparation');
                                    })->orWhereHas('sub_prog', function ($query) {
                                        $query->where('sub_prog_name', 'like', '%Tutoring%');
                                    })->pluck('prog_id')->toArray();
---
select `prog_id` from `tbl_prog` where exists (select * from `tbl_main_prog` where `tbl_prog`.`main_prog_id` = `tbl_main_prog`.`id` and `prog_name` = 'Admissions Mentoring') or exists (select * from `tbl_sub_prog` where `tbl_prog`.`sub_prog_id` = `tbl_sub_prog`.`id` and `sub_prog_name` = 'Admissions Mentoring')
select `prog_id` from `tbl_prog` where exists (select * from `tbl_main_prog` where `tbl_prog`.`main_prog_id` = `tbl_main_prog`.`id` and `prog_name` = 'Academic & Test Preparation') or exists (select * from `tbl_sub_prog` where `tbl_prog`.`sub_prog_id` = `tbl_sub_prog`.`id` and `sub_prog_name` like '%Tutoring%')

    public function rules()
    {

        $admission_prog_id = Program::whereHas('main_prog', function($query) {
                                $query->where('prog_name', 'Admissions Mentoring');
                            })->orWhereHas('sub_prog', function ($query) {
                                $query->where('sub_prog_name', 'Admissions Mentoring');
                            })->pluck('prog_id')->toArray();

        $tutoring_prog_id = Program::whereHas('sub_prog', function ($query) {
                                $query->where('sub_prog_name', 'like', '%Tutoring%');
                            })->pluck('prog_id')->toArray();

        $satact_prog_id = Program::whereHas('sub_prog', function ($query) {
                                $query->where('sub_prog_name', 'like', '%SAT%')->orWhere('sub_prog_name', 'like', '%ACT%');
                            })->pluck('prog_id')->toArray();

        $studentId = $this->route('student');
        $student = $this->clientRepository->getClientById($studentId);
        $isMentee = $student->roles()->where('role_name', 'like', '%mentee%')->count();

        $clientProg = $this->clientProgramRepository->getClientProgramById($this->route('program'));
        $hasInvoice = isset($clientProg->invoice) ? $clientProg->invoice()->count() : 0;
        $hasReceipt = isset($clientProg->invoice->receipt) ? $clientProg->invoice->receipt()->count() : 0;
---
select `prog_id` from `tbl_prog` where exists (select * from `tbl_main_prog` where `tbl_prog`.`main_prog_id` = `tbl_main_prog`.`id` and `prog_name` = 'Admissions Mentoring') or exists (select * from `tbl_sub_prog` where `tbl_prog`.`sub_prog_id` = `tbl_sub_prog`.`id` and `sub_prog_name` = 'Admissions Mentoring')
select `prog_id` from `tbl_prog` where exists (select * from `tbl_sub_prog` where `tbl_prog`.`sub_prog_id` = `tbl_sub_prog`.`id` and `sub_prog_name` like '%Tutoring%')
select `prog_id` from `tbl_prog` where exists (select * from `tbl_sub_prog` where `tbl_prog`.`sub_prog_id` = `tbl_sub_prog`.`id` and (`sub_prog_name` like '%SAT%' or `sub_prog_name` like '%ACT%'))
select count(*) as aggregate from `tbl_roles` inner join `tbl_client_roles` on `tbl_roles`.`id` = `tbl_client_roles`.`role_id` where `tbl_client_roles`.`client_id` = 1503 and `role_name` like '%mentee%'
select count(*) as aggregate from `tbl_inv` where `tbl_inv`.`clientprog_id` = 1911 and `tbl_inv`.`clientprog_id` is not null
select count(*) as aggregate from `tbl_receipt` where `tbl_receipt`.`inv_id` = '0028/INV-JEI/AAUP/VII/23' and `tbl_receipt`.`inv_id` is not null

                        function ($attribute, $value, $fail) use ($clientProg) {
                            $studentId = $this->route('student');
                            $student = UserClient::find($studentId);
---
select * from `tbl_client` where `tbl_client`.`id` = '1503' limit 1

                function ($attribute, $value, $fail) {
                    if ($this->input('lead_id') == 'kol' && empty($value))
                        $fail('The KOL name field is required');

                    if (!Lead::where('main_lead', 'KOL')->where('lead_id', $value)->get())
---
select * from `tbl_lead` where `main_lead` = 'KOL' and `lead_id` is null

                function ($attribute, $value, $fail) {
                    if (!User::with('roles')->whereHas('roles', function ($q) {
                        $q->where('role_name', 'Employee');
                    })->find($value)) {
---
select * from `users` where exists (select * from `tbl_roles` inner join `tbl_user_roles` on `tbl_roles`.`id` = `tbl_user_roles`.`role_id` where `users`.`id` = `tbl_user_roles`.`user_id` and `role_name` = 'Employee') and `users`.`id` = '4' limit 1
select `tbl_roles`.*, `tbl_user_roles`.`user_id` as `pivot_user_id`, `tbl_user_roles`.`role_id` as `pivot_role_id`, `tbl_user_roles`.`extended_id` as `pivot_extended_id`, `tbl_user_roles`.`tutor_subject` as `pivot_tutor_subject`, `tbl_user_roles`.`feehours` as `pivot_feehours`, `tbl_user_roles`.`feesession` as `pivot_feesession`, `tbl_user_roles`.`created_at` as `pivot_created_at`, `tbl_user_roles`.`updated_at` as `pivot_updated_at` from `tbl_roles` inner join `tbl_user_roles` on `tbl_roles`.`id` = `tbl_user_roles`.`role_id` where `tbl_user_roles`.`user_id` in (4)

                function ($attribute, $value, $fail) {
                    if (!User::with('roles')->whereHas('roles', function ($q) {
                        $q->where('role_name', 'Mentor');
                    })->find($value)) {
---
select * from `users` where exists (select * from `tbl_roles` inner join `tbl_user_roles` on `tbl_roles`.`id` = `tbl_user_roles`.`role_id` where `users`.`id` = `tbl_user_roles`.`user_id` and `role_name` = 'Mentor') and `users`.`id` = '138' limit 1
select `tbl_roles`.*, `tbl_user_roles`.`user_id` as `pivot_user_id`, `tbl_user_roles`.`role_id` as `pivot_role_id`, `tbl_user_roles`.`extended_id` as `pivot_extended_id`, `tbl_user_roles`.`tutor_subject` as `pivot_tutor_subject`, `tbl_user_roles`.`feehours` as `pivot_feehours`, `tbl_user_roles`.`feesession` as `pivot_feesession`, `tbl_user_roles`.`created_at` as `pivot_created_at`, `tbl_user_roles`.`updated_at` as `pivot_updated_at` from `tbl_roles` inner join `tbl_user_roles` on `tbl_roles`.`id` = `tbl_user_roles`.`role_id` where `tbl_user_roles`.`user_id` in (138)

                function ($attribute, $value, $fail) use ($studentId) {
                    if (!User::with('roles')->whereHas('roles', function ($q) {
                        $q->where('role_name', 'Mentor');
                    })->find($value)) {
                        $fail('The submitted mentor was invalid mentor');
                    }

                    if (UserClient::whereHas('clientMentor', function($query) use ($value) {
                        $query->where('users.id', $value);
                    })->where('id', $studentId)->count() > 0) {
---
select * from `users` where exists (select * from `tbl_roles` inner join `tbl_user_roles` on `tbl_roles`.`id` = `tbl_user_roles`.`role_id` where `users`.`id` = `tbl_user_roles`.`user_id` and `role_name` = 'Mentor') and `users`.`id` = '2' limit 1
select `tbl_roles`.*, `tbl_user_roles`.`user_id` as `pivot_user_id`, `tbl_user_roles`.`role_id` as `pivot_role_id`, `tbl_user_roles`.`extended_id` as `pivot_extended_id`, `tbl_user_roles`.`tutor_subject` as `pivot_tutor_subject`, `tbl_user_roles`.`feehours` as `pivot_feehours`, `tbl_user_roles`.`feesession` as `pivot_feesession`, `tbl_user_roles`.`created_at` as `pivot_created_at`, `tbl_user_roles`.`updated_at` as `pivot_updated_at` from `tbl_roles` inner join `tbl_user_roles` on `tbl_roles`.`id` = `tbl_user_roles`.`role_id` where `tbl_user_roles`.`user_id` in (2)
select count(*) as aggregate from `tbl_client` where exists (select * from `users` inner join `tbl_client_prog` on `tbl_client_prog`.`clientprog_id` = `users`.`id` where `tbl_client`.`id` = `tbl_client_prog`.`client_id` and `users`.`id` = '2') and `id` = '1503'