app/Http/Controllers/ClientProgramController.php

    public function __construct(ClientRepositoryInterface $clientRepository, ProgramRepositoryInterface $programRepository, LeadRepositoryInterface $leadRepository, EventRepositoryInterface $eventRepository, EdufLeadRepositoryInterface $edufLeadRepository, UserRepositoryInterface $userRepository, CorporateRepositoryInterface $corporateRepository, ReasonRepositoryInterface $reasonRepository, ClientProgramRepositoryInterface $clientProgramRepository, ClientEventRepositoryInterface $clientEventRepository, SchoolRepositoryInterface $schoolRepository, TagRepositoryInterface $tagRepository, ClientProgramLogMailRepositoryInterface $clientProgramLogMailRepository)
    {
        $this->clientRepository = $clientRepository;
        $this->programRepository = $programRepository;
        $this->leadRepository = $leadRepository;
        $this->eventRepository = $eventRepository;
        $this->edufLeadRepository = $edufLeadRepository;
        $this->userRepository = $userRepository;
        $this->corporateRepository = $corporateRepository;
        $this->reasonRepository = $reasonRepository;
        $this->clientProgramRepository = $clientProgramRepository;
        $this->clientEventRepository = $clientEventRepository;
        $this->schoolRepository = $schoolRepository;
        $this->tagRepository = $tagRepository;
        $this->clientProgramLogMailRepository = $clientProgramLogMailRepository;

        $this->admission_prog_list = Program::whereHas('main_prog', function ($query) {
            $query->where('prog_name', 'Admissions Mentoring');
        })->orWhereHas('sub_prog', function ($query) {
            $query->where('sub_prog_name', 'Admissions Mentoring');
        })->pluck('prog_id')->toArray();

        $this->tutoring_prog_list = Program::whereHas('sub_prog', function ($query) {
            $query->where('sub_prog_name', 'like', '%Tutoring%');
        })->pluck('prog_id')->toArray();

        $this->satact_prog_list = Program::whereHas('sub_prog', function ($query) {
            $query->where('sub_prog_name', 'like', '%SAT%')->orWhere('sub_prog_name', 'like', '%ACT%');
        })->pluck('prog_id')->toArray();
---
select `prog_id` from `tbl_prog` where exists (select * from `tbl_main_prog` where `tbl_prog`.`main_prog_id` = `tbl_main_prog`.`id` and `prog_name` = 'Admissions Mentoring') or exists (select * from `tbl_sub_prog` where `tbl_prog`.`sub_prog_id` = `tbl_sub_prog`.`id` and `sub_prog_name` = 'Admissions Mentoring')
select `prog_id` from `tbl_prog` where exists (select * from `tbl_sub_prog` where `tbl_prog`.`sub_prog_id` = `tbl_sub_prog`.`id` and `sub_prog_name` like '%Tutoring%')
select `prog_id` from `tbl_prog` where exists (select * from `tbl_sub_prog` where `tbl_prog`.`sub_prog_id` = `tbl_sub_prog`.`id` and (`sub_prog_name` like '%SAT%' or `sub_prog_name` like '%ACT%'))

                    # if he/she join admission mentoring program
                    # add role mentee
                    if (in_array($progId, $this->admission_prog_list)) {
                        $last_id = UserClient::max('st_id');
---
select max(`st_id`) as aggregate from `tbl_client`