app/Models/ClientProgram.php

select * from `tbl_client_prog` where `clientprog_id` = '1911' limit 1
---
    public static function whereClientProgramId($id)
    {
        if (is_array($id) && empty($id)) return new Collection;

        $instance = new static;

        return $instance->newQuery()->where('clientprog_id', $id)->first();