app/Models/Program.php

select * from `tbl_prog` where `prog_id` = 'AAUP' limit 1
---
    public static function whereProgId($id)
    {
        if (is_array($id) && empty($id)) return new Collection;

        $instance = new static;

        return $instance->newQuery()->where('prog_id', $id)->first();