app/Providers/AppServiceProvider.php

select count(*) as aggregate from `tbl_department` inner join `tbl_user_type_detail` on `tbl_department`.`id` = `tbl_user_type_detail`.`department_id` where `tbl_user_type_detail`.`user_id` = 24 and `tbl_user_type_detail`.`status` = 1
select count(*) as aggregate from `tbl_roles` inner join `tbl_user_roles` on `tbl_roles`.`id` = `tbl_user_roles`.`role_id` where `tbl_user_roles`.`user_id` = 24 and `role_name` = 'admin'
select `tbl_department`.*, `tbl_user_type_detail`.`user_id` as `pivot_user_id`, `tbl_user_type_detail`.`department_id` as `pivot_department_id`, `tbl_user_type_detail`.`user_type_id` as `pivot_user_type_id`, `tbl_user_type_detail`.`start_date` as `pivot_start_date`, `tbl_user_type_detail`.`end_date` as `pivot_end_date`, `tbl_user_type_detail`.`status` as `pivot_status`, `tbl_user_type_detail`.`created_at` as `pivot_created_at`, `tbl_user_type_detail`.`updated_at` as `pivot_updated_at` from `tbl_department` inner join `tbl_user_type_detail` on `tbl_department`.`id` = `tbl_user_type_detail`.`department_id` where `tbl_user_type_detail`.`user_id` = 24 and `tbl_user_type_detail`.`status` = 1
---
    public function boot()
    {
        view()->composer('*', function ($view) {

            $user = auth()->user();
            $collection = new Collection();


            if (isset($user) && ($user->department()->wherePivot('status', 1)->count() > 0 || $user->roles()->where('role_name', 'admin')->count() > 0) ) {
                foreach ($user->department()->wherePivot('status', 1)->get() as $menus) {

select exists(select * from `tbl_roles` inner join `tbl_user_roles` on `tbl_roles`.`id` = `tbl_user_roles`.`role_id` where `tbl_user_roles`.`user_id` = 24 and `role_name` = 'admin') as `exists`
---

                # if logged in user is admin
                $department = null;
                if ($user->roles()->where('role_name', 'admin')->exists()) {

select exists(select * from `tbl_department` inner join `tbl_user_type_detail` on `tbl_department`.`id` = `tbl_user_type_detail`.`department_id` where `tbl_user_type_detail`.`user_id` = 24 and `dept_name` = 'Client Management' and `status` = 1) as `exists`
---
                }

                # if logged in user is from department sales
                if ($user->department()->where('dept_name', 'Client Management')->where('status', 1)->exists()) {

select exists(select * from `tbl_department` inner join `tbl_user_type_detail` on `tbl_department`.`id` = `tbl_user_type_detail`.`department_id` where `tbl_user_type_detail`.`user_id` = 24 and `dept_name` = 'Business Development' and `status` = 1) as `exists`
---
                }

                # if logged in user is from department partnership
                if ($user->department()->where('dept_name', 'Business Development')->where('status', 1)->exists()) {

select exists(select * from `tbl_department` inner join `tbl_user_type_detail` on `tbl_department`.`id` = `tbl_user_type_detail`.`department_id` where `tbl_user_type_detail`.`user_id` = 24 and `dept_name` = 'Finance & Operation' and `status` = 1) as `exists`
---
                }

                # if logged in user is from department finance
                if ($user->department()->where('dept_name', 'Finance & Operation')->where('status', 1)->exists()) {

select exists(select * from `tbl_department` inner join `tbl_user_type_detail` on `tbl_department`.`id` = `tbl_user_type_detail`.`department_id` where `tbl_user_type_detail`.`user_id` = 24 and `dept_name` = 'Digital' and `status` = 1) as `exists`
---
                }

                # if logged in user is from department finance
                if ($user->department()->where('dept_name', 'Digital')->where('status', 1)->exists()) {