app/Providers/AppServiceProvider.php

    public function boot()
    {
        /* pagination */
        Collection::macro('paginate', function ($perPage = 15, $page = null, $options = []) {
            $page = $page ?: (LengthAwarePaginator::resolveCurrentPage() ?: 1);
            $paginator = new LengthAwarePaginator(
                items: $this->forPage($page, $perPage),
                total: $this->count(),
                perPage: $perPage,
                currentPage: $page,
                options: $options
            );

            return $paginator->withPath(Request::url());
        });


        /* queue logger */
        Queue::after(function (JobProcessed $event) {
            Log::debug('Queue : '.json_encode($event).' has ran');
        });


        /* menu manager */
        view()->composer('*', function ($view) {

            $user = auth()->user();
            $collection = new Collection();

            # check if the user has authenticated
            if (isset($user) && (($user->department()->wherePivot('status', 1)->count() > 0 || $user->roles()->where('role_name', 'Super Admin')->count() > 0)) ) {
                if(!Cache::has('menu')){
                    foreach ($user->department()->wherePivot('status', 1)->get() as $menus) {
                        foreach ($menus->access_menus as $menu) {

                            // $keyMenu = $collection->where('submenu_name', $menu->submenu_name)->keys()->first();
                            // Delete submenu by key
                            // $collection->forget($keyMenu);

                            $collection->push([
                                'order_no' => $menu->mainmenu->order_no,
                                'order_no_submenu' => $menu->order_no,
                                'menu_id' => $menu->pivot->menu_id,
                                'mainmenu_id' => $menu->mainmenu->id,
                                'mainmenu_name' => $menu->mainmenu->mainmenu_name,
---
select `tbl_menus`.*, `tbl_menus_user`.`user_id` as `pivot_user_id`, `tbl_menus_user`.`menu_id` as `pivot_menu_id`, `tbl_menus_user`.`copy` as `pivot_copy`, `tbl_menus_user`.`export` as `pivot_export`, `tbl_menus_user`.`created_at` as `pivot_created_at`, `tbl_menus_user`.`updated_at` as `pivot_updated_at` from `tbl_menus` inner join `tbl_menus_user` on `tbl_menus`.`id` = `tbl_menus_user`.`menu_id` where `tbl_menus_user`.`user_id` = 24