app/Repositories/ClientProgramRepository.php

select distinct `program_name`, `prog_id` from `clientprogram`
---
    public function getAllProgramOnClientProgram()
    {
        return ViewClientProgram::distinct('program_name')->select('program_name', 'prog_id')->get();

select distinct `conversion_lead`, `lead_id` from `clientprogram`
---
    public function getAllConversionLeadOnClientProgram()
    {
        return ViewClientProgram::distinct('conversion_lead')->select('conversion_lead', 'lead_id')->get();

select distinct `users`.`id`, CONCAT(users.first_name, " ", COALESCE(users.last_name, "")) as fullname from `tbl_client_mentor` left join `users` on `users`.`id` = `tbl_client_mentor`.`user_id`
---
    public function getAllMentorTutorOnClientProgram()
    {
        return ClientMentor::leftJoin('users', 'users.id', '=', 'tbl_client_mentor.user_id')->distinct('user_id')
            ->select('users.id', DB::raw('CONCAT(users.first_name, " ", COALESCE(users.last_name, "")) as fullname'))->get();

select distinct `empl_id`, `pic_name` from `clientprogram`
---
    public function getAllPICOnClientProgram()
    {
        return ViewClientProgram::distinct('empl_id')->select('empl_id', 'pic_name')->get();

update `tbl_client_prog` set `lead_id` = 'LS005', `prog_id` = 'AAUP', `clientevent_id` = '', `eduf_lead_id` = '', `partner_id` = '', `first_discuss_date` = '2023-07-18', `meeting_notes` = '', `status` = '1', `empl_id` = '4', `initconsult_date` = '2023-07-21', `assessmentsent_date` = '2023-07-24', `trial_date` = '', `success_date` = '2023-07-26', `prog_start_date` = '', `prog_end_date` = '2024-06-26', `total_uni` = '10', `total_foreign_currency` = '0', `foreign_currency` = 'usd', `foreign_currency_exchange` = '0', `total_idr` = '60000000', `installment_notes` = '<p>27 July 2023: (100%) IDR 60.000.000</p>', `prog_running_status` = '1', `timesheet_link` = '', `test_date` = '', `last_class` = '', `diag_score` = 0, `test_score` = 0, `failed_date` = '', `reason_id` = '', `refund_date` = '', `client_id` = '1503', `tbl_client_prog`.`updated_at` = '2023-11-15 11:44:03' where `clientprog_id` = '1911'
---
            unset($clientProgramDetails['session_tutor_detail']);
        }

        $clientProgram = ClientProgram::where('clientprog_id', $clientProgramId)->update(array_merge($fullDetails, $clientProgramDetails));