app/Repositories/ClientRepository.php

    public function getMaxGraduationYearFromClient()
    {
        return Client::max('graduation_year');
---
select max(`graduation_year`) as aggregate from `client`

    public function getAllClientByRole($roleName, $month = null) # mentee, parent, teacher
    {
        $alumnis = UserClient::whereHas('clientProgram', function ($q2) {
            $q2->whereIn('prog_running_status', [2]);
        })->withCount([
            'clientProgram as client_program_count' => function ($query) {
                $query->whereIn('prog_running_status', [0, 1, 2])->whereHas('program', function ($q2) {
                    $q2->whereHas('main_prog', function ($q3) {
                        $q3->where('prog_name', 'Admissions Mentoring');
                    });
                });
            },
            'clientProgram as client_program_finish_count' => function ($query) {
                $query->where('prog_running_status', 2)->whereHas('program', function ($q2) {
                    $q2->whereHas('main_prog', function ($q3) {
                        $q3->where('prog_name', 'Admissions Mentoring');
                    });
                });
            }
        ])->havingRaw('client_program_count = client_program_finish_count')->pluck('tbl_client.id')->toArray();

        return UserClient::when($roleName == "alumni", function ($query) {
            $query->whereHas('clientProgram', function ($q2) {
                $q2->whereIn('prog_running_status', [2]);
            })->withCount([
                'clientProgram as client_program_count' => function ($query) {
                    $query->whereIn('prog_running_status', [0, 1, 2])->whereHas('program', function ($q2) {
                        $q2->whereHas('main_prog', function ($q3) {
                            $q3->where('prog_name', 'Admissions Mentoring');
                        });
                    });
                },
                'clientProgram as client_program_finish_count' => function ($query) {
                    $query->where('prog_running_status', 2)->whereHas('program', function ($q2) {
                        $q2->whereHas('main_prog', function ($q3) {
                            $q3->where('prog_name', 'Admissions Mentoring');
                        });
                    });
                }
            ])->havingRaw('client_program_count = client_program_finish_count');
        }, function ($query) use ($roleName, $alumnis) {
            $query->when($roleName == 'mentee', function ($query2) use ($alumnis) {
                $query2->whereNotIn('tbl_client.id', $alumnis);
            })->whereHas('roles', function ($query2) use ($roleName) {
                $query2->where('role_name', $roleName);
            });
        })->when($month, function ($query) use ($month) {
            $query->whereMonth('tbl_client.created_at', date('m', strtotime($month)))->whereYear('tbl_client.created_at', date('Y', strtotime($month)));
        })->get();
---
select * from `tbl_client` where exists (select * from `tbl_roles` inner join `tbl_client_roles` on `tbl_roles`.`id` = `tbl_client_roles`.`role_id` where `tbl_client`.`id` = `tbl_client_roles`.`client_id` and `role_name` = 'Teacher/Counselor') and month(`tbl_client`.`created_at`) = '11' and year(`tbl_client`.`created_at`) = '2023'

    public function updateClient($clientId, array $newDetails)
    {
        return UserClient::whereId($clientId)->update($newDetails);
---
select * from `client` where `client`.`id` = '1503' limit 1

    public function attachClientRelation($parentId, $studentId)
    {
        $student = UserClient::where('id', $studentId)->first();
---
select * from `client` where `client`.`id` = '1503' limit 1

    public function createManyClientRelation($parentId, $studentId)
    {
        $parent = UserClient::find($parentId);
---
select * from `tbl_client` where `tbl_client`.`id` = '1503' limit 1