app/Repositories/ClientLeadTrackingRepository.php

select * from `tbl_client_lead_tracking` where `client_id` = '1503' and `status` = 1 order by `updated_at` desc
---
    public function getCurrentClientLead($client_id)
    {
        return ClientLeadTracking::where('client_id', $client_id)->where('status', 1)->orderBy('updated_at', 'desc')->get();

select * from `tbl_client_lead_tracking` where `client_id` = '1503'
select * from `tbl_reason` where `tbl_reason`.`reason_id` = 122 limit 1
---
    public function getHistoryClientLead($client_id)
    {
        $clientLeadTracking = ClientLeadTracking::where('client_id', $client_id)->get();
        $leads = $clientLeadTracking->where('type', 'Lead');
        $merge = $clientLeadTracking->where('type', 'Program')->mapToGroups(function ($item, $key) use($leads) {
            $lead = $leads->where('group_id', $item['group_id'])->first();
            return [
                $item->initProg->name => [
                    'status' => $item['status'],
                    'initprog' => $item->initProg->name,
                    'created_at' => $item['created_at'],
                    'updated_at' => $item['updated_at'],
                    'total_result_program' => $item['total_result'],
                    'total_result_lead' => $lead['total_result'],
                    'program_status' => $item['program_status'],
                    'lead_status' => $lead['lead_status'],
                    'reason' => isset($lead->reason) ? $lead->reason->reason_name : null,
                ],
            ];
        });

select * from `tbl_client_prog` where month(`created_at`) = '11' and year(`created_at`) = '2023' order by `created_at` asc
---
    public function getInitialConsult($monthyear, $type)
    {
        $clientLeads = $this->getMonthlyClientLeadTracking($monthyear);
        $clientId = null;
        foreach ($clientLeads as $clientLead) {
            $clientId[] = $clientLead->client_id;
        }

        $clientProg = ClientProgram::leftJoin('tbl_prog', 'tbl_prog.prog_id', '=', 'tbl_client_prog.prog_id')
            ->leftJoin('tbl_main_prog', 'tbl_main_prog.id', '=', 'tbl_prog.main_prog_id')
            // ->select('client_id')
            ->whereHas('program', function ($query) {
                $query->whereHas('main_prog', function ($query2) {
                    $query2->where('prog_name', 'like', '%Admissions Mentoring%');
                })->whereHas('sub_prog', function ($query2) {
                    $query2->where('sub_prog_name', 'like', '%Admissions Mentoring%');
                });
            })
            ->whereMonth('tbl_client_prog.assessmentsent_date', date('m', strtotime($monthyear)))
            ->whereYear('tbl_client_prog.assessmentsent_date', date('Y', strtotime($monthyear)));

        if($type == 'success'){
            $clientProg->where('status', 1);
        }

        $clientId != null ?  $clientProg->whereIn('client_id', $clientId) : null;
        $clientProg->groupBy('client_id');

        return $clientId != null ? $clientProg->get() : null;

update `tbl_client_lead_tracking` set `status` = 0, `tbl_client_lead_tracking`.`updated_at` = '2023-11-15 11:44:03' where `id` = 433
---
    public function updateClientLeadTrackingByType($clientId, $initProgId, $type, array $leadTrackingDetails)
    {
        return ClientLeadTracking::where('client_id', $clientId)->where('initialprogram_id', $initProgId)->where('type', $type)->update($leadTrackingDetails);