app/Repositories/ClientEventRepository.php

    public function getReportClientEventsGroupByRoles($eventId = null)
    {
        $clientEvent = ClientEvent::leftJoin('tbl_client', 'tbl_client.id', '=', 'tbl_client_event.client_id')
            ->leftJoin('tbl_client_roles', 'tbl_client_roles.client_id', '=', 'tbl_client.id')
            ->leftJoin('tbl_roles', 'tbl_roles.id', '=', 'tbl_client_roles.role_id')
            ->leftJoin('tbl_client_prog', 'tbl_client_prog.client_id', '=', 'tbl_client.id')
            ->leftJoin('program', 'program.prog_id', '=', 'tbl_client_prog.prog_id')
            ->leftJoin('tbl_inv', 'tbl_inv.clientprog_id', '=', 'tbl_client_prog.clientprog_id')
            ->leftJoin('tbl_receipt', 'tbl_receipt.inv_id', '=', 'tbl_inv.inv_id')
            ->select(
                'tbl_client.register_as',
                'tbl_client_event.clientevent_id',
                'tbl_client_event.client_id',
                'tbl_client_event.created_at',
                'tbl_client_event.joined_date',
                'program.main_prog_id',
                'tbl_roles.role_name',
                'tbl_client_prog.status',
                'tbl_receipt.id as id_receipt'
            );

        if (isset($eventId)) {
            return $clientEvent
                ->where('tbl_client_event.event_id', $eventId)
                ->get();
        } else {
            return $clientEvent
                ->whereMonth('tbl_client_event.created_at', date('m'))->whereYear('tbl_client_event.created_at', date('Y'))
                ->get();
---
select * from `tbl_client_event` where `client_id` = '1503'