app/Repositories/CurriculumRepository.php

    public function getAllCurriculum()
    {
        return Curriculum::orderBy('name', 'asc')->get();
---
select * from `tbl_curriculum` order by `name` asc