app/Repositories/DepartmentRepository.php

    public function getAllDepartment()
    {
        return Department::orderBy('dept_name', 'asc')->get();
---
select * from `tbl_department` order by `dept_name` asc

    public function getEmployeeByDepartment($departmentId)
    {
        $department = Department::find($departmentId);

        return $department->users->where('pivot.status', 1);
---
select * from `tbl_department` where `tbl_department`.`id` = '2' limit 1
select `users`.*, `tbl_user_type_detail`.`department_id` as `pivot_department_id`, `tbl_user_type_detail`.`user_id` as `pivot_user_id`, `tbl_user_type_detail`.`created_at` as `pivot_created_at`, `tbl_user_type_detail`.`updated_at` as `pivot_updated_at` from `users` inner join `tbl_user_type_detail` on `users`.`id` = `tbl_user_type_detail`.`user_id` where `tbl_user_type_detail`.`department_id` = 2 and `tbl_user_type_detail`.`status` = 1