app/Repositories/EdufLeadRepository.php

    public function getAllEdufairLead()
    {
        return EdufLead::leftJoin('tbl_corp', 'tbl_corp.corp_id', '=', 'tbl_eduf_lead.corp_id')->
            leftJoin('tbl_sch', 'tbl_sch.sch_id', '=', 'tbl_eduf_lead.sch_id')->
            leftJoin('users', 'users.id', '=', 'tbl_eduf_lead.intr_pic')->
            select([
                'tbl_eduf_lead.id', 'tbl_eduf_lead.location', 'tbl_eduf_lead.intr_pic',
                'tbl_eduf_lead.ext_pic_name', 'tbl_eduf_lead.ext_pic_mail', 'tbl_eduf_lead.ext_pic_phone', 'tbl_eduf_lead.first_discussion_date',
                'tbl_eduf_lead.last_discussion_date', 'tbl_eduf_lead.event_start', 'tbl_eduf_lead.event_end', 'tbl_eduf_lead.status', 'tbl_eduf_lead.notes',
                'tbl_eduf_lead.created_at', 'tbl_eduf_lead.updated_at', 'tbl_eduf_lead.sch_id', 'tbl_eduf_lead.corp_id',
                DB::raw("IF (tbl_eduf_lead.sch_id IS NOT NULL, tbl_sch.sch_name, tbl_corp.corp_name) as organizer_name")
            ])->orderBy('organizer_name', 'asc')->
            get();
---
select `tbl_eduf_lead`.`id`, `tbl_eduf_lead`.`location`, `tbl_eduf_lead`.`intr_pic`, `tbl_eduf_lead`.`ext_pic_name`, `tbl_eduf_lead`.`ext_pic_mail`, `tbl_eduf_lead`.`ext_pic_phone`, `tbl_eduf_lead`.`first_discussion_date`, `tbl_eduf_lead`.`last_discussion_date`, `tbl_eduf_lead`.`event_start`, `tbl_eduf_lead`.`event_end`, `tbl_eduf_lead`.`status`, `tbl_eduf_lead`.`notes`, `tbl_eduf_lead`.`created_at`, `tbl_eduf_lead`.`updated_at`, `tbl_eduf_lead`.`sch_id`, `tbl_eduf_lead`.`corp_id`, IF (tbl_eduf_lead.sch_id IS NOT NULL, tbl_sch.sch_name, tbl_corp.corp_name) as organizer_name from `tbl_eduf_lead` left join `tbl_corp` on `tbl_corp`.`corp_id` = `tbl_eduf_lead`.`corp_id` left join `tbl_sch` on `tbl_sch`.`sch_id` = `tbl_eduf_lead`.`sch_id` left join `users` on `users`.`id` = `tbl_eduf_lead`.`intr_pic` order by `organizer_name` asc