app/Repositories/EventRepository.php

select * from `tbl_events` order by `created_at` desc
---
    public function getAllEvents()
    {
        return Event::orderBy('created_at', 'desc')->get();

select * from `tbl_events` where `event_title` is null limit 1
---
    public function getEventByName($eventName)
    {
        return Event::where('event_title', $eventName)->first();

select * from `tbl_events` where month(`event_startdate`) = '11' and year(`event_startdate`) = '2023'
---
    public function getEventByMonthyear($monthyear)
    {
        return Event::whereMonth('event_startdate', date('m', strtotime($monthyear)))
                        ->whereYear('event_startdate', date('Y', strtotime($monthyear)))
                        ->get();

select `tbl_events`.*, (select count(*) from `tbl_client_event` where `tbl_events`.`event_id` = `tbl_client_event`.`event_id`) as `participants` from `tbl_events` where exists (select * from `tbl_client_event` where `tbl_events`.`event_id` = `tbl_client_event`.`event_id` and year(`tbl_client_event`.`created_at`) = '2023')
---
    public function getEventsWithParticipants($cp_filter)
    {
        $userId = $this->getUser($cp_filter);
        $current_year = date('Y');
        $last_3_year = date('Y') - 2;

        return Event::withCount('clientEvent as participants')->whereHas('clientEvent', function ($query) use ($cp_filter, $current_year, $last_3_year) {

            $query->when($cp_filter['qyear'] == "last-3-year", function ($sq) use ($current_year, $last_3_year) {
                $sq->whereRaw('YEAR(tbl_client_event.created_at) BETWEEN ? AND ?', [$last_3_year, $current_year]);
                // $sq->whereYearBetween('tbl_client_event.created_at', [date('Y')-2, date('Y')]);
            }, function ($sq) use ($cp_filter) {
                $sq->whereYear('tbl_client_event.created_at', date('Y'));
            });
        })->when($userId, function ($query) use ($userId) {
            $query->whereHas('eventPic', function ($query) use ($userId) {
                $query->where('users.id', $userId);
            });
        })->get();