app/Repositories/FollowupRepository.php

select * from `tbl_followup` where `followup_date` between '2023-11-16' and '2023-11-23' order by `followup_date` asc
---
    public function getAllFollowupWithin($days, $month = null)
    {
        $today = date('Y-m-d');
        $lastday = date('Y-m-d', strtotime('+'.$days.' days'));

        $data = [];

        # employee that logged in
        $empl_id = auth()->guard('api')->user()->id ?? auth()->user()->id;

        $followup = FollowUp::when($month, function($query) use ($month) {
                        $query->whereMonth('followup_date', date('m', strtotime($month)))->whereYear('followup_date', date('Y', strtotime($month)));
                    }, function ($query) use ($today, $lastday) {
                        $query->whereBetween('followup_date', [$today, $lastday]);
                    })->
                    when(Session::get('user_role') == 'Employee', function ($query) use ($empl_id) {
                        $query->whereHas('clientProgram', function ($subQuery) use ($empl_id) {
                            $subQuery->where(function ($Q2) use ($empl_id) {
                                $Q2->where('empl_id', $empl_id)->orWhereHas('client', function ($Q3) use ($empl_id) {
                                    $Q3->whereHas('handledBy', function ($Q4) use ($empl_id) {
                                        $Q4->where('users.id', $empl_id);
                                    });
                                });
                            });
                        });
                    })->
                    when(auth()->guard('api')->user(), function ($query) use ($empl_id) {
                        $query->whereHas('clientProgram', function ($subQuery) use ($empl_id) {
                            $subQuery->where(function ($Q2) use ($empl_id) {
                                $Q2->where('empl_id', $empl_id)->orWhereHas('client', function ($Q3) use ($empl_id) {
                                    $Q3->whereHas('handledBy', function ($Q4) use ($empl_id) {