app/Repositories/InvoiceProgramRepository.php

select `fullname` as `client_name`, `program`.`program_name`, `pic_name`, `success_date`, `clientprog_id` as `client_prog_id`, 'client_prog' as type from `clientprogram` left join `program` on `program`.`prog_id` = `clientprogram`.`prog_id` where not exists (select * from `tbl_inv` where `clientprogram`.`clientprog_id` = `tbl_inv`.`clientprog_id`) and `status` = 1 and year(`success_date`) = '2023' and month(`success_date`) = '11'
---
    public function getTotalInvoiceNeeded($monthYear)
    {
        $year = date('Y', strtotime($monthYear));
        $month = date('m', strtotime($monthYear));

        return ViewClientProgram::doesntHave('invoice')
            ->leftJoin('program', 'program.prog_id', '=', 'clientprogram.prog_id')
            ->select(
                'fullname as client_name',
                'program.program_name',
                'pic_name',
                'success_date',
                'clientprog_id as client_prog_id',
                DB::raw("'client_prog' as type"),

            )
            ->where('status', 1)
            ->whereYear('success_date', '=', $year)
            ->whereMonth('success_date', '=', $month)
            ->get();

select `tbl_inv`.`id`, `tbl_invdtl`.`invdtl_id`, `tbl_inv`.`inv_totalprice_idr`, `tbl_inv`.`inv_paymentmethod`, `tbl_invdtl`.`invdtl_amountidr` from `tbl_inv` left join `tbl_invdtl` on `tbl_invdtl`.`inv_id` = `tbl_inv`.`inv_id` left join `clientprogram` on `clientprogram`.`clientprog_id` = `tbl_inv`.`clientprog_id` where year((CASE
WHEN tbl_inv.inv_paymentmethod = "Full Payment" THEN
tbl_inv.inv_duedate
WHEN tbl_inv.inv_paymentmethod = "Installment" THEN
tbl_invdtl.invdtl_duedate
END)) = '2023' and month((CASE
WHEN tbl_inv.inv_paymentmethod = "Full Payment" THEN
tbl_inv.inv_duedate
WHEN tbl_inv.inv_paymentmethod = "Installment" THEN
tbl_invdtl.invdtl_duedate
END)) = '11' and `clientprogram`.`status` = 1
---
    public function getTotalInvoice($monthYear)
    {
        $year = date('Y', strtotime($monthYear));
        $month = date('m', strtotime($monthYear));

        $whereBy = DB::raw('(CASE
                            WHEN tbl_inv.inv_paymentmethod = "Full Payment" THEN
                                tbl_inv.inv_duedate
                            WHEN tbl_inv.inv_paymentmethod = "Installment" THEN
                                tbl_invdtl.invdtl_duedate
                        END)');

        return InvoiceProgram::leftJoin('tbl_invdtl', 'tbl_invdtl.inv_id', '=', 'tbl_inv.inv_id')
            ->leftJoin('clientprogram', 'clientprogram.clientprog_id', '=', 'tbl_inv.clientprog_id')
            ->select(
                'tbl_inv.id',
                'tbl_invdtl.invdtl_id',
                'tbl_inv.inv_totalprice_idr',
                'tbl_inv.inv_paymentmethod',
                'tbl_invdtl.invdtl_amountidr'
            )->whereYear($whereBy, '=', $year)
            ->whereMonth($whereBy, '=', $month)
            ->where('clientprogram.status', 1)
            ->get();

select SUM(tbl_receipt.receipt_amount_idr) as total, MONTH(tbl_receipt.created_at) as month from `tbl_inv` left join `tbl_invdtl` on `tbl_invdtl`.`inv_id` = `tbl_inv`.`inv_id` left join `tbl_receipt` on (CASE
WHEN tbl_inv.inv_paymentmethod = "Full Payment" THEN
tbl_receipt.inv_id
WHEN tbl_inv.inv_paymentmethod = "Installment" THEN
tbl_receipt.invdtl_id
ELSE null
END ) = CASE
WHEN tbl_inv.inv_paymentmethod = "Full Payment" THEN
tbl_inv.inv_id
WHEN tbl_inv.inv_paymentmethod = "Installment" THEN
tbl_invdtl.invdtl_id
ELSE null
END where year(`tbl_receipt`.`created_at`) = '2023' and exists (select * from `tbl_client_prog` where `tbl_inv`.`clientprog_id` = `tbl_client_prog`.`clientprog_id` and `status` = 1) and `tbl_receipt`.`id` is not null group by MONTH(tbl_receipt.created_at)
---
    public function getRevenueByYear($year)
    {
        return InvoiceProgram::leftJoin('tbl_invdtl', 'tbl_invdtl.inv_id', '=', 'tbl_inv.inv_id')
            ->leftJoin(
                'tbl_receipt',
                DB::raw('(CASE
                        WHEN tbl_inv.inv_paymentmethod = "Full Payment" THEN
                            tbl_receipt.inv_id
                        WHEN tbl_inv.inv_paymentmethod = "Installment" THEN
                                tbl_receipt.invdtl_id
                        ELSE null
                    END )'),
                DB::raw('CASE
                        WHEN tbl_inv.inv_paymentmethod = "Full Payment" THEN
                            tbl_inv.inv_id
                        WHEN tbl_inv.inv_paymentmethod = "Installment" THEN
                                tbl_invdtl.invdtl_id
                        ELSE null
                    END')
            )
            ->select(DB::raw('SUM(tbl_receipt.receipt_amount_idr) as total'), DB::raw('MONTH(tbl_receipt.created_at) as month'))
            ->whereYear('tbl_receipt.created_at', '=', $year)
            ->whereRelation('clientprog', 'status', 1)
            ->whereNotNull('tbl_receipt.id')
            ->groupBy(DB::raw('MONTH(tbl_receipt.created_at)'))
            ->get();