app/Repositories/LeadRepository.php

select * from `tbl_lead` order by `main_lead` asc, `sub_lead` asc
---
    public function getAllLead()
    {
        return Lead::orderBy('main_lead', 'asc')->orderBy('sub_lead', 'asc')->get();

select * from `tbl_lead` where `sub_lead` is null order by `main_lead` asc
---
    public function getAllMainLead()
    {
        return Lead::where('sub_lead', NULL)->orderBy('main_lead', 'asc')->get();

select * from `tbl_lead` where `main_lead` = 'KOL' order by `sub_lead` asc
---
    public function getAllKOLlead()
    {
        return Lead::where('main_lead', 'KOL')->orderBy('sub_lead', 'asc')->get();