app/Repositories/MenuRepository.php

select `tbl_main_menus`.`mainmenu_name`, `tbl_main_menus`.`order_no` as `order_no_mainmenu`, `tbl_menus`.`id` as `menu_id`, `tbl_main_menus`.`id` as `main_menu_id`, `tbl_menus`.`submenu_name`, `tbl_menus`.`submenu_link`, `tbl_menus`.`order_no`, `tbl_main_menus`.`icon` from `tbl_menus` inner join `tbl_main_menus` on `tbl_main_menus`.`id` = `tbl_menus`.`mainmenu_id` order by `tbl_main_menus`.`order_no` asc, `tbl_menus`.`order_no` asc
---
    public function getMenu()
    {
        $collection = new Collection();
        $menus = Menu::join('tbl_main_menus', 'tbl_main_menus.id', '=', 'tbl_menus.mainmenu_id')
            ->select([
                'tbl_main_menus.mainmenu_name',
                'tbl_main_menus.order_no as order_no_mainmenu',
                'tbl_menus.id as menu_id',
                'tbl_main_menus.id as main_menu_id',
                'tbl_menus.submenu_name',
                'tbl_menus.submenu_link',
                'tbl_menus.order_no',
                'tbl_main_menus.icon',
            ])->orderBy('tbl_main_menus.order_no', 'asc')->orderBy('tbl_menus.order_no', 'asc')->get();

select * from `users` where `uuid` = '5682b1c4-9b1e-4638-a0f9-0eb06d1b8036' limit 1
---
    public function getUserAccess($userId)
    {
        $user = User::where('uuid', $userId)->first();

select * from `tbl_department` where `tbl_department`.`id` = '1' limit 1
---
    public function getDepartmentAccess($departmentId)
    {
        $department = Department::find($departmentId);