app/Repositories/PartnerAgreementRepository.php

select count(*) as aggregate from `tbl_partner_agreement` where `end_date` between '2023-11-16' and '2023-11-23'
---
    public function getPartnerAgreementByMonthly($monthYear, $type)
    {
        $today = Carbon::today()->format('Y-m-d');
        $date = Carbon::today()->addDays(7)->format('Y-m-d');

        $query = PartnerAgreement::whereBetween('end_date', [$today, $date]);

        return in_array($type, ['all', 'monthly']) ? $query->count() : ($type === 'list' ? $query->get() : null);