app/Repositories/PartnerProgramRepository.php

select `tbl_corp`.`corp_name` as `corp_name`, `program`.`program_name` from `tbl_partner_prog` left join `tbl_corp` on `tbl_corp`.`corp_id` = `tbl_partner_prog`.`corp_id` left join `program` on `program`.`prog_id` = `tbl_partner_prog`.`prog_id` where year((CASE
WHEN tbl_partner_prog.status = 0 THEN tbl_partner_prog.created_at
WHEN tbl_partner_prog.status = 1 THEN tbl_partner_prog.success_date
WHEN tbl_partner_prog.status = 2 THEN tbl_partner_prog.denied_date
WHEN tbl_partner_prog.status = 3 THEN tbl_partner_prog.refund_date
WHEN tbl_partner_prog.status = 4 THEN tbl_partner_prog.accepted_date
WHEN tbl_partner_prog.status = 5 THEN tbl_partner_prog.cancel_date
END)) = '2023' and month((CASE
WHEN tbl_partner_prog.status = 0 THEN tbl_partner_prog.created_at
WHEN tbl_partner_prog.status = 1 THEN tbl_partner_prog.success_date
WHEN tbl_partner_prog.status = 2 THEN tbl_partner_prog.denied_date
WHEN tbl_partner_prog.status = 3 THEN tbl_partner_prog.refund_date
WHEN tbl_partner_prog.status = 4 THEN tbl_partner_prog.accepted_date
WHEN tbl_partner_prog.status = 5 THEN tbl_partner_prog.cancel_date
END)) = '11' and `tbl_partner_prog`.`status` = 0
---
    public function getAllPartnerProgramByStatusAndMonth($status, $monthYear)
    {
        $year = date('Y', strtotime($monthYear));
        $month = date('m', strtotime($monthYear));

        return PartnerProg::leftJoin('tbl_corp', 'tbl_corp.corp_id', '=', 'tbl_partner_prog.corp_id')
            ->leftJoin('tbl_prog', 'tbl_prog.prog_id', '=', 'tbl_partner_prog.prog_id')
            ->leftJoin('tbl_sub_prog', 'tbl_sub_prog.id', '=', 'tbl_prog.sub_prog_id')
            ->select(
                'tbl_corp.corp_name as corp_name',
                DB::raw('(CASE
                            WHEN tbl_prog.sub_prog_id > 0 THEN CONCAT(tbl_sub_prog.sub_prog_name," - ",tbl_prog.prog_program)
                            ELSE tbl_prog.prog_program
                        END) AS program_name')
            )
            ->whereYear(
                DB::raw('(CASE
                            WHEN tbl_partner_prog.status = 0 THEN tbl_partner_prog.created_at
                            WHEN tbl_partner_prog.status = 1 THEN tbl_partner_prog.success_date
                            WHEN tbl_partner_prog.status = 2 THEN tbl_partner_prog.denied_date
                            WHEN tbl_partner_prog.status = 3 THEN tbl_partner_prog.refund_date
                        END)'),
                '=',
                $year
            )
            ->whereMonth(
                DB::raw('(CASE
                            WHEN tbl_partner_prog.status = 0 THEN tbl_partner_prog.created_at
                            WHEN tbl_partner_prog.status = 1 THEN tbl_partner_prog.success_date
                            WHEN tbl_partner_prog.status = 2 THEN tbl_partner_prog.denied_date
                            WHEN tbl_partner_prog.status = 3 THEN tbl_partner_prog.refund_date
                        END)'),
                '=',
                $month
            )
            ->where('tbl_partner_prog.status', $status)
            ->get();

(select 'end' as 'type', count(id) as count, sum(total_fee) as total_fee from `tbl_partner_prog` where `status` = 1 and year(`success_date`) = '2023') union (select 'start' as 'type', count(id) as count, sum(total_fee) as total_fee from `tbl_partner_prog` where `status` = 1 and year(`success_date`) = '2022')
---
    public function getTotalPartnerProgramComparison($startYear, $endYear)
    {
        $start = PartnerProg::select(DB::raw("'start' as 'type'"), DB::raw('count(id) as count'), DB::raw('sum(total_fee) as total_fee'))
            ->where('status', 1)
            ->whereYear('success_date', $startYear);

        $end = PartnerProg::select(DB::raw("'end' as 'type'"), DB::raw('count(id) as count'), DB::raw('sum(total_fee) as total_fee'))
            ->where('status', 1)
            ->whereYear('success_date', $endYear)
            ->union($start)
            ->get();

select `tbl_partner_prog`.`prog_id`, `program`.`program_name`, 'Partner Program' as type, (CASE
WHEN SUM(participants) is null THEN 0
ELSE SUM(participants)
END) as participants, DATE_FORMAT(success_date, "%Y") as year, SUM(total_fee) as total, count(tbl_partner_prog.prog_id) as count_program from `tbl_partner_prog` left join `program` on `program`.`prog_id` = `tbl_partner_prog`.`prog_id` where `status` = 1 and year(`success_date`) = (case year(success_date)
when 2022 then 2022
when 2023 then 2023
end) group by `tbl_partner_prog`.`prog_id`, year(success_date)
---
    public function getPartnerProgramComparison($startYear, $endYear)
    {
        return PartnerProg::leftJoin('tbl_prog', 'tbl_prog.prog_id', '=', 'tbl_partner_prog.prog_id')
            ->leftJoin('tbl_sub_prog', 'tbl_sub_prog.id', '=', 'tbl_prog.sub_prog_id')
            ->select(
                'tbl_partner_prog.prog_id',
                DB::raw('(CASE
                            WHEN tbl_prog.sub_prog_id > 0 THEN CONCAT(tbl_sub_prog.sub_prog_name," - ",tbl_prog.prog_program)
                            ELSE tbl_prog.prog_program
                        END) AS program_name'),
                DB::raw("'Partner Program' as type"),
                DB::raw('(CASE
                            WHEN SUM(participants) is null THEN 0
                            ELSE SUM(participants)
                        END) as participants'),
                DB::raw('DATE_FORMAT(success_date, "%Y") as year'),
                DB::raw("SUM(total_fee) as total"),
                DB::raw('count(tbl_partner_prog.prog_id) as count_program')
            )
            ->where('status', 1)
            ->whereYear(
                'success_date',
                '=',
                DB::raw('(case year(success_date)
                                when ' . $startYear . ' then ' . $startYear . '
                                when ' . $endYear . ' then ' . $endYear . '
                            end)')
            )
            ->groupBy('tbl_partner_prog.prog_id')
            ->groupBy(DB::raw('year(success_date)'))
            ->get();