app/Repositories/ReasonRepository.php

    public function getReasonById($reasonId)
    {
        return Reason::find($reasonId);
---
select * from `tbl_reason` where `type` = 'Program'