app/Repositories/ReferralRepository.php

select `tbl_referral`.`prog_id`, CASE tbl_referral.referral_type
WHEN "Out" THEN tbl_referral.additional_prog_name
WHEN "In"
THEN
program.program_name
END AS program_name, CASE tbl_referral.referral_type
WHEN "Out" THEN "Referral Out"
WHEN "In" THEN "Referral In"
END AS type, SUM(number_of_student) as participants, (CASE
WHEN SUM(number_of_student) is null THEN 0
ELSE SUM(number_of_student)
END) as participants, DATE_FORMAT(ref_date, "%Y") as year, SUM(revenue) as total, CASE tbl_referral.referral_type
WHEN "Out" THEN count(tbl_referral.additional_prog_name)
WHEN "In" THEN count(tbl_referral.prog_id)
END AS count_program from `tbl_referral` left join `program` on `program`.`prog_id` = `tbl_referral`.`prog_id` where year(`ref_date`) = (case year(ref_date)
when 2022 then 2022
when 2023 then 2023
end) group by `tbl_referral`.`prog_id`, year(ref_date)
---
    public function getReferralComparison($startYear, $endYear)
    {
        return Referral::leftJoin('program', 'program.prog_id', '=', 'tbl_referral.prog_id')
            // ->leftJoin('tbl_main_prog', 'tbl_main_prog.id', '=', 'tbl_prog.main_prog_id')
            // ->leftJoin('tbl_sub_prog', 'tbl_sub_prog.id', '=', 'tbl_prog.sub_prog_id')
            ->select(
                'tbl_referral.prog_id',
                DB::raw(
                    'CASE tbl_referral.referral_type
                        WHEN "Out" THEN tbl_referral.additional_prog_name
                        WHEN "In"
                            THEN
                               program.program_name
                    END AS program_name'
                ),
                DB::raw(
                    'CASE tbl_referral.referral_type
                        WHEN "Out" THEN "Referral Out"
                        WHEN "In" THEN "Referral In"
                    END AS type'
                ),
                DB::raw('SUM(number_of_student) as participants'),
                DB::raw('(CASE
                            WHEN SUM(number_of_student) is null THEN 0
                            ELSE SUM(number_of_student)
                        END) as participants'),
                DB::raw('DATE_FORMAT(ref_date, "%Y") as year'),
                DB::raw("SUM(revenue) as total"),
                // DB::raw('count(tbl_referral.prog_id) as count_program')
                DB::raw(
                    'CASE tbl_referral.referral_type
                            WHEN "Out" THEN count(tbl_referral.additional_prog_name)
                            WHEN "In" THEN count(tbl_referral.prog_id)
                        END AS count_program'
                ),
            )
            ->whereYear(
                'ref_date',
                '=',
                DB::raw('(case year(ref_date)
                                when ' . $startYear . ' then ' . $startYear . '
                                when ' . $endYear . ' then ' . $endYear . '
                            end)')
            )
            ->groupBy('tbl_referral.prog_id')
            ->groupBy(DB::raw('year(ref_date)'))
            ->get();

(select 'end' as 'type', `referral_type`, count(id) as count, sum(revenue) as total_fee from `tbl_referral` where year(`ref_date`) = '2023' group by `referral_type`) union (select 'start' as 'type', `referral_type`, count(id) as count, sum(revenue) as total_fee from `tbl_referral` where year(`ref_date`) = '2022' group by `referral_type`)
---
    public function getTotalReferralProgramComparison($startYear, $endYear)
    {
        $start = Referral::select(DB::raw("'start' as 'type'"), 'referral_type', DB::raw('count(id) as count'), DB::raw('sum(revenue) as total_fee'))
            ->whereYear('ref_date', $startYear)
            ->groupBy('referral_type');

        $end = Referral::select(DB::raw("'end' as 'type'"), 'referral_type', DB::raw('count(id) as count'), DB::raw('sum(revenue) as total_fee'))
            ->whereYear('ref_date', $endYear)
            ->groupBy('referral_type')
            ->union($start)
            ->get();