app/Repositories/RoleRepository.php

select * from `tbl_roles` where LOWER(role_name) = ('mentee') limit 1
---
    public function getRoleByName($roleName)
    {
        return Role::whereRaw('LOWER(role_name) = (?)', [strtolower($roleName)])->first();