app/Repositories/SalesTargetRepository.php

select CAST(YEAR(month_year) AS VARCHAR(4)) + '-' + right('00' + CAST(MONTH(month_year) AS VARCHAR(2)), 2) as month_year, SUM(total_participant) as total_participant, SUM(total_target) as total_target from `tbl_sales_target` where month(`month_year`) = '11' and year(`month_year`) = '2023' group by CAST(YEAR(month_year) AS VARCHAR(4)) + '-' + right('00' + CAST(MONTH(month_year) AS VARCHAR(2)), 2) limit 1
---
    public function getMonthlySalesTarget($programId, $filter)
    {
        return SalesTarget::when($programId, function ($query) use ($programId) {
            $query->where('prog_id', $programId);
        })
            ->when($filter['qdate'], function ($query) use ($filter) {
                $query->whereMonth('month_year', date('m', strtotime($filter['qdate'])))
                    ->whereYear('month_year', date('Y', strtotime($filter['qdate'])));
            })
            ->select([
                DB::raw("CONCAT(CAST(YEAR(month_year) AS CHAR(4)), '-', LPAD(CAST(MONTH(month_year) AS CHAR(2)), 2, '0')) as month_year"),
                DB::raw('SUM(total_participant) as total_participant'),
                DB::raw('SUM(total_target) as total_target'),
            ])
            ->groupBy(DB::raw("CONCAT(CAST(YEAR(month_year) AS CHAR(4)), '-', LPAD(CAST(MONTH(month_year) AS CHAR(2)), 2, '0'))"))
            ->first();

select COUNT(*) as total_participant, SUM(tbl_inv.inv_totalprice_idr) as total_target from `tbl_client_prog` left join `tbl_inv` on `tbl_inv`.`clientprog_id` = `tbl_client_prog`.`clientprog_id` where month(`tbl_client_prog`.`success_date`) = '11' and year(`tbl_client_prog`.`success_date`) = '2023' limit 1
---
    public function getMonthlySalesActual($programId, $filter)
    {
        $userId = null;
        if (isset($filter['quuid'])) {
            $user = User::where('id', $filter['quuid'])->first();
            $userId = $user->id;
        }

        $salesTarget = SalesTarget::when($programId, function ($query) use ($programId) {
            $query->where('tbl_sales_target.prog_id', $programId);
        })->when($filter['qdate'], function ($query) use ($filter) {
            $query->whereMonth('tbl_sales_target.month_year', date('m', strtotime($filter['qdate'])))->whereYear('tbl_sales_target.month_year', date('Y', strtotime($filter['qdate'])));
        })->groupBy(DB::raw('(CASE WHEN tbl_sales_target.prog_id is null THEN tbl_sales_target.main_prog_id ELSE tbl_sales_target.prog_id END)'))->get();

        $mapping = $salesTarget->map(function ($item) use ($filter, $userId) {

            $totalActualParticipant = ClientProgram::whereHas('program', function ($q) use ($item) {
                if ($item->prog_id == null) {
                    $q->where('main_prog_id', $item->main_prog_id);
                } else {
                    $q->where('prog_id', $item->prog_id);
                }
            })->when($userId, function ($query) use ($userId) {
                $query->where('empl_id', $userId);
            })
                ->select(DB::raw('count(*) as count_participant'))
                ->where('status', 1)
                ->whereMonth('success_date', date('m', strtotime($filter['qdate'])))
                ->whereYear('success_date', date('Y', strtotime($filter['qdate'])))
                ->first();

            $totalActualAmount = InvoiceProgram::leftJoin('tbl_client_prog', 'tbl_inv.clientprog_id', '=', 'tbl_client_prog.clientprog_id')
                ->whereHas('clientprog', function ($q) use ($item, $userId) {
                    $q->whereHas('program', function ($q2) use ($item) {
                        if ($item->prog_id == null) {