app/Repositories/SchoolRepository.php

    public function getAllSchoolDataTables($isRaw = false)
    {
        $query = School::orderBy('created_at', 'desc')->
                    when($isRaw, function ($subQuery) {
                        $subQuery->isNotVerified();
                    }, function ($subQuery) {
                        $subQuery->isVerified();
                    });

        return Datatables::eloquent($query)->rawColumns(['sch_location'])
            ->addColumn('sch_type_text', function ($data) {
                return str_replace('_', ' ', $data->sch_type);
            })
            ->addColumn('curriculum', function ($data) {
                $no = 1;
                $curriculums = '';
                foreach ($data->curriculum as $curriculum) {
                    if ($no == 1)
                        $curriculums = $curriculum->name;
                    else
                        $curriculums .= ', ' . $curriculum->name;

                    $no++;
                }
                return $curriculums;
            })
            ->filterColumn('curriculum', function ($query, $keyword) {
                $query->whereHas('curriculum', function ($q) use ($keyword) {
                    $q->where('name', 'like', '%' . $keyword . '%');
                });
---
select `tbl_curriculum`.*, `tbl_sch_curriculum`.`sch_id` as `pivot_sch_id`, `tbl_sch_curriculum`.`curriculum_id` as `pivot_curriculum_id`, `tbl_sch_curriculum`.`created_at` as `pivot_created_at`, `tbl_sch_curriculum`.`updated_at` as `pivot_updated_at` from `tbl_curriculum` inner join `tbl_sch_curriculum` on `tbl_curriculum`.`id` = `tbl_sch_curriculum`.`curriculum_id` where `tbl_sch_curriculum`.`sch_id` = 'SCH-0908'