app/Repositories/TargetTrackingRepository.php

select * from `target_tracking` where month(`month_year`) = '11' and year(`month_year`) = '2023'
---
    public function getAllTargetTrackingMonthly($monthYear)
    {
        return TargetTracking::whereMonth('month_year', date('m', strtotime($monthYear)))
                                ->whereYear('month_year', date('Y', strtotime($monthYear)))
                                ->get();

select * from `target_tracking` where month(`month_year`) = '11' and year(`month_year`) = '2023' and `divisi` = 'Sales' limit 1
---
    public function getTargetTrackingMonthlyByDivisi($monthYear, $divisi)
    {
        return TargetTracking::whereMonth('month_year', date('m', strtotime($monthYear)))
                                ->whereYear('month_year', date('Y', strtotime($monthYear)))
                                ->where('divisi', $divisi)
                                ->first();

select SUM(contribution_target) as target, SUM(contribution_achieved) as actual, Month(month_year) as month from `target_tracking` group by Month(month_year)
select `revenue_target` as `target`, `revenue_achieved` as `actual`, Month(month_year) as month from `target_tracking` group by Month(month_year)
---
    public function getTargetTrackingPeriod($startDate, $endDate, $type)
    {
        switch ($type) {
            case 'lead':
                $query = TargetTracking::select(DB::raw('SUM(contribution_target) as target'), DB::raw('SUM(contribution_achieved) as actual'), DB::raw('Month(month_year) as month'))
                           ->groupBy(DB::raw('Month(month_year)'))->get();
                break;
            case 'revenue':
                $query = TargetTracking::select('revenue_target as target', 'revenue_achieved as actual', DB::raw('Month(month_year) as month'))
                        ->groupBy(DB::raw('Month(month_year)'))->get();