app/Repositories/UserRepository.php

    public function getAllUsersByRole($role)
    {
        return User::with('department')->whereHas('roles', function ($query) use ($role) {
            $query->where('role_name', 'like', '%'.$role);
        })->where('active', 1)->orderBy('first_name', 'asc')->orderBy('last_name', 'asc')->get();
---
select * from `users` where exists (select * from `tbl_roles` inner join `tbl_user_roles` on `tbl_roles`.`id` = `tbl_user_roles`.`role_id` where `users`.`id` = `tbl_user_roles`.`user_id` and `role_name` like '%Tutor') and `active` = 1 order by `first_name` asc, `last_name` asc
select `tbl_department`.*, `tbl_user_type_detail`.`user_id` as `pivot_user_id`, `tbl_user_type_detail`.`department_id` as `pivot_department_id`, `tbl_user_type_detail`.`user_type_id` as `pivot_user_type_id`, `tbl_user_type_detail`.`start_date` as `pivot_start_date`, `tbl_user_type_detail`.`end_date` as `pivot_end_date`, `tbl_user_type_detail`.`status` as `pivot_status`, `tbl_user_type_detail`.`created_at` as `pivot_created_at`, `tbl_user_type_detail`.`updated_at` as `pivot_updated_at` from `tbl_department` inner join `tbl_user_type_detail` on `tbl_department`.`id` = `tbl_user_type_detail`.`department_id` where `tbl_user_type_detail`.`user_id` in (2, 65, 87, 88, 90, 91, 108, 113, 114, 115, 116, 117, 118, 119, 120, 123, 124, 125, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 144, 145, 146, 147, 149, 155, 156, 157, 158, 159, 160, 161, 166, 167, 168)

    public function getAllUsersByDepartmentAndRole($role, $department)
    {
        return User::whereHas('roles', function ($query) use ($role) {
            $query->where('role_name', 'like', '%'.$role);
        })->whereHas('department', function ($query) use ($department) {
            $query->where('dept_name', 'like', '%'.$department.'%');
        })->where('active', 1)->orderBy('first_name', 'asc')->orderBy('last_name', 'asc')->get();
---
select * from `users` where exists (select * from `tbl_roles` inner join `tbl_user_roles` on `tbl_roles`.`id` = `tbl_user_roles`.`role_id` where `users`.`id` = `tbl_user_roles`.`user_id` and `role_name` like '%employee') and exists (select * from `tbl_department` inner join `tbl_user_type_detail` on `tbl_department`.`id` = `tbl_user_type_detail`.`department_id` where `users`.`id` = `tbl_user_type_detail`.`user_id` and `dept_name` like '%Client Management%') and `active` = 1 order by `first_name` asc, `last_name` asc